[
  {
    "id": 1,
    "owner": "Karn",
    "url": "/Coldridge/wheat/wheat3.jpg",
    "content": "<p>hi there. Thank you so much for the updates it looks great. However with the modern times, it would be nice to be able to use part in on our phones. I have a Samsung Galaxy S 5. When I view the website the navigation and buttons take up a ton of room and makes it hard to read. Would it be possible to make a mobile app for Karchan? Or somehow fix the navigation and button table on the web page so that it can be used again. My email is quixoticparody@gmail.com if you would like a tester, screen shots, or just a chit chat.</p>",
    "length": 36099,
    "mimeType": "image/jpeg",
    "createDate": "2017-03-09T11:37:16Z"
  },
  {
    "id": 2,
    "owner": "Karn",
    "url": "/Coldridge/chapel2.jpg",
    "content": "<p>Hi there,&nbsp;</p>\n<p>I am writing to you deputies in regards to last night. Specifically, I logged on as Yasec in order to request, again, that the red anvil placed in front of the Church of Affluence be removed because it has absolutely no logical reason for being there. Here is the deal as I understand it.</p>\n<p>Months and months and months ago, Thaeloc wanted to start a roleplay in which he waged war on all the evil guilds in Karchan. Using the symbol of his God, he delivered a message to a few guilds in order to get that point across.&nbsp;</p>\n<p>The headquarters for the Crimson Paladins, and probably all Obsidian affiliated guilds are known.&nbsp;</p>\n<p>The headquarters for the Blood Knights guild (the one that was destroyed without any apparent reason as soon as Andy left, and the castle given to Blayd) is known.</p>\n<p>The headquarters of the Church of Corruption- unknown. It is buried under the frontman 'Church of Affluence' way out in the Ocean.&nbsp;</p>\n<p>So, I am perfectly willing to accept that it was placed there for a few reasons. A. A God put it there, somehow knows Yasec's location. Most of your have Gods, and realms, in which are protected by Ultimate Magnum Trojan Titanium magically enchanced impenetrable forcefields. But I'm willing to accept roleplayed intrusions if someone would at least have spoken to me about it. No one did other than Thaeloc, and he didn't know jack. More on that in a second.</p>\n<p>B. A follower of Corruption lead Thaeloc there and betrayed the Church . Fine. No one said anything to me about it.</p>\n<p>C. Someone got followed there. No one told me about it. In fact, the only person who has said dick to me about the placement of that Anvil is Thaeloc, who I have spoken to, and repeatedly told me he had no idea how he was suppose to know about it.&nbsp;</p>\n<p>More on Thaeloc. I talked to Thaeloc about the placement of that Anvil, and explained the deal to him. Months ago. THaeloc agreed to, and&nbsp;<em>specifically told me</em>&nbsp;that he asked to have it moved. It never was. I wias willing to work on it, but silence is apparently truly golden. Piss colored, in fact.&nbsp;</p>\n<p>I haven't said anything about the placement of that Anvil for a long ass time, during those months and months. I waited for it to get removed, and nope. Nadda.&nbsp;</p>\n<p>So to last night. I pinged two deputies about its removal, Victoria and Ephinie. Victoria was willing to do it, and I am greatful for that. I continued to ping Erika about it before I realized Victoria's response, this is exactly what I said.</p>\n<p>ooc: Whatever the point was of putting this anvil on the island, despite the fact there is no logical basis for it being here, I'd like it removed. Whatever roleplay that was attached to it never happened.\"</p>\n<p>The response I got to it was 'I'll get to it when I get to it.\"</p>\n<p>It takes two freaken seconds to remove that anvil. She could have done it forever ago, didn't do it. No explaination as to why its there, no explaination as to why I&nbsp;<em>and</em>Thaeloc's request went unaccounted for. Not a thing. &nbsp;So, you'll have to forgive me if I don't see this entire situation as Ephinie shitting in the Church of Corruption's front lawn, and translating 'I'll get to it when I get to it' as 'I'll do what I fucking want, when I want. I pay twenty dollars a month. I can abuse the situation as I deem fit.\"</p>\n<p>Now, according to the laws of the game, which are\"Deputie aren't held accountable to anyone, we pay for the game. We'll read your roleplays and text them between us for fun.\" She can do whatever the hell she likes.</p>\n<p>Well folks, the Church of Corruption is&nbsp;<em>my goddamn guild</em>. If I wanted to change the storyline, rank affiliates, and members, you'll have to forgive me but I will do like I damn well please. Yasec had no reason to remove Gvuaidoin from her position? You don't know that. Hey! Maybe there is a roleplay involved I'm just not telling you about. It isn't harrassment, it isn't unfair treatment, it was the fucking final straw. If you want to throw some punishments at me for it, be my guest. I won't apologize for it, and I don't feel bad about it. Oh, and if you'll check the guilddetails, you'll see Gvaudoin hasn't been removed from her position anyway. It was a paper tiger for someone who was acting like a complete jerk for no reason other than that she could.&nbsp;</p>\n<p>So, if the lot of you think what I did was unjust and unfair, consider for a moment that Ephinie and I haven't been on good terms forever. Never took it out on her characters before, never did jack despite that stupid anvil sitting there for no apparent reason. By the way, she knew it would piss me off. I got a nice little synopsis from Thaeloc all about it. &nbsp;</p>\n<p>So, in conclusion, I said what I said, and I don't feel sorry about it. In fact, I think she had it coming. My behavior was, I think at least, more than a little understandable, if not acceptable. &nbsp;So,&nbsp;<em>if</em>&nbsp;you are considering punishment. Please take a good, hard look at this situation, consider some of your own situations, and reconsider mine a few times.&nbsp;</p>\n<p>Peace out,</p>\n<p>-Case</p>",
    "length": 34983,
    "mimeType": "image/jpeg",
    "createDate": "2013-08-03T21:47:30Z"
  },
  {
    "id": 3,
    "owner": "Karn",
    "url": "/Coldridge/magiclab.jpg",
    "content": "<p>It works! :D</p>",
    "length": 34172,
    "mimeType": "image/jpeg",
    "createDate": "2012-04-18T09:01:16Z"
  },
  {
    "id": 4,
    "owner": "Karn",
    "url": "/Coldridge/examroom.jpg",
    "content": "<p>can you please change gurth's race to duergar?</p>\n\n<p>&nbsp;</p>\n\n<p>thx</p>",
    "length": 33919,
    "mimeType": "image/jpeg",
    "createDate": "2012-02-02T21:29:51Z"
  }
]