[
  {
    "toname": "Karn",
    "name": "Pravas",
    "subject": "smart phone use",
    "body": "<p>hi there. Thank you so much for the updates it looks great. However with the modern times, it would be nice to be able to use part in on our phones. I have a Samsung Galaxy S 5. When I view the website the navigation and buttons take up a ton of room and makes it hard to read. Would it be possible to make a mobile app for Karchan? Or somehow fix the navigation and button table on the web page so that it can be used again. My email is quixoticparody@gmail.com if you would like a tester, screen shots, or just a chit chat.</p>",
    "id": 36099,
    "haveread": true,
    "newmail": false,
    "whensent": "2017-03-09T11:37:16Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Yasec",
    "subject": "Red Anvils",
    "body": "<p>Hi there,&nbsp;</p>\n<p>I am writing to you deputies in regards to last night. Specifically, I logged on as Yasec in order to request, again, that the red anvil placed in front of the Church of Affluence be removed because it has absolutely no logical reason for being there. Here is the deal as I understand it.</p>\n<p>Months and months and months ago, Thaeloc wanted to start a roleplay in which he waged war on all the evil guilds in Karchan. Using the symbol of his God, he delivered a message to a few guilds in order to get that point across.&nbsp;</p>\n<p>The headquarters for the Crimson Paladins, and probably all Obsidian affiliated guilds are known.&nbsp;</p>\n<p>The headquarters for the Blood Knights guild (the one that was destroyed without any apparent reason as soon as Andy left, and the castle given to Blayd) is known.</p>\n<p>The headquarters of the Church of Corruption- unknown. It is buried under the frontman 'Church of Affluence' way out in the Ocean.&nbsp;</p>\n<p>So, I am perfectly willing to accept that it was placed there for a few reasons. A. A God put it there, somehow knows Yasec's location. Most of your have Gods, and realms, in which are protected by Ultimate Magnum Trojan Titanium magically enchanced impenetrable forcefields. But I'm willing to accept roleplayed intrusions if someone would at least have spoken to me about it. No one did other than Thaeloc, and he didn't know jack. More on that in a second.</p>\n<p>B. A follower of Corruption lead Thaeloc there and betrayed the Church . Fine. No one said anything to me about it.</p>\n<p>C. Someone got followed there. No one told me about it. In fact, the only person who has said dick to me about the placement of that Anvil is Thaeloc, who I have spoken to, and repeatedly told me he had no idea how he was suppose to know about it.&nbsp;</p>\n<p>More on Thaeloc. I talked to Thaeloc about the placement of that Anvil, and explained the deal to him. Months ago. THaeloc agreed to, and&nbsp;<em>specifically told me</em>&nbsp;that he asked to have it moved. It never was. I wias willing to work on it, but silence is apparently truly golden. Piss colored, in fact.&nbsp;</p>\n<p>I haven't said anything about the placement of that Anvil for a long ass time, during those months and months. I waited for it to get removed, and nope. Nadda.&nbsp;</p>\n<p>So to last night. I pinged two deputies about its removal, Victoria and Ephinie. Victoria was willing to do it, and I am greatful for that. I continued to ping Erika about it before I realized Victoria's response, this is exactly what I said.</p>\n<p>ooc: Whatever the point was of putting this anvil on the island, despite the fact there is no logical basis for it being here, I'd like it removed. Whatever roleplay that was attached to it never happened.\"</p>\n<p>The response I got to it was 'I'll get to it when I get to it.\"</p>\n<p>It takes two freaken seconds to remove that anvil. She could have done it forever ago, didn't do it. No explaination as to why its there, no explaination as to why I&nbsp;<em>and</em>Thaeloc's request went unaccounted for. Not a thing. &nbsp;So, you'll have to forgive me if I don't see this entire situation as Ephinie shitting in the Church of Corruption's front lawn, and translating 'I'll get to it when I get to it' as 'I'll do what I fucking want, when I want. I pay twenty dollars a month. I can abuse the situation as I deem fit.\"</p>\n<p>Now, according to the laws of the game, which are\"Deputie aren't held accountable to anyone, we pay for the game. We'll read your roleplays and text them between us for fun.\" She can do whatever the hell she likes.</p>\n<p>Well folks, the Church of Corruption is&nbsp;<em>my goddamn guild</em>. If I wanted to change the storyline, rank affiliates, and members, you'll have to forgive me but I will do like I damn well please. Yasec had no reason to remove Gvuaidoin from her position? You don't know that. Hey! Maybe there is a roleplay involved I'm just not telling you about. It isn't harrassment, it isn't unfair treatment, it was the fucking final straw. If you want to throw some punishments at me for it, be my guest. I won't apologize for it, and I don't feel bad about it. Oh, and if you'll check the guilddetails, you'll see Gvaudoin hasn't been removed from her position anyway. It was a paper tiger for someone who was acting like a complete jerk for no reason other than that she could.&nbsp;</p>\n<p>So, if the lot of you think what I did was unjust and unfair, consider for a moment that Ephinie and I haven't been on good terms forever. Never took it out on her characters before, never did jack despite that stupid anvil sitting there for no apparent reason. By the way, she knew it would piss me off. I got a nice little synopsis from Thaeloc all about it. &nbsp;</p>\n<p>So, in conclusion, I said what I said, and I don't feel sorry about it. In fact, I think she had it coming. My behavior was, I think at least, more than a little understandable, if not acceptable. &nbsp;So,&nbsp;<em>if</em>&nbsp;you are considering punishment. Please take a good, hard look at this situation, consider some of your own situations, and reconsider mine a few times.&nbsp;</p>\n<p>Peace out,</p>\n<p>-Case</p>",
    "id": 34983,
    "haveread": false,
    "newmail": false,
    "whensent": "2013-08-03T21:47:30Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Risk",
    "subject": "Yep!",
    "body": "<p>It works! :D</p>",
    "id": 34172,
    "haveread": true,
    "newmail": false,
    "whensent": "2012-04-18T09:01:16Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "gurth",
    "subject": "ooc race change",
    "body": "<p>can you please change gurth's race to duergar?</p>\n\n<p>&nbsp;</p>\n\n<p>thx</p>",
    "id": 33919,
    "haveread": true,
    "newmail": false,
    "whensent": "2012-02-02T21:29:51Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Venus",
    "subject": "Character restoration",
    "body": "<p>Hi Karn,&nbsp;</p>\n\n<p>I noticed the game went through a huge overhaul and it looks great, but it seems as if my character has been deleted... Is there anyway of restoring this to being? I only ask because Kel had customized my description for my character and I had a few special items in my inventory.</p>\n\n<p>&nbsp;</p>\n\n<p>Thanks a ton!</p>\n\n<p>-Venus</p>",
    "id": 33219,
    "haveread": true,
    "newmail": false,
    "whensent": "2011-09-01T05:46:03Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "SkyeFyre",
    "subject": "Thank you!!!",
    "body": "<p>For fixing mudmail! *happy dance*</p>\n\n<p>&nbsp;</p>\n\n<p>Skye</p>",
    "id": 32879,
    "haveread": true,
    "newmail": false,
    "whensent": "2011-05-21T04:33:04Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Aolinn",
    "subject": "The Character Sheets",
    "body": "<p>You left before I could tell how AMAZING that looks!&nbsp; Everyone is going to be so happy that you can delete people off of your character sheets now.&nbsp; I know I am, and so is Jess (my girlfriend).</p>\n\n<p>I'm really happy that you did this.&nbsp; You're my hero now &lt;3&nbsp; I can't give you enough hearts!</p>\n\n<p>&nbsp;</p>\n\n<p>-Nettie</p>",
    "id": 32848,
    "haveread": true,
    "newmail": false,
    "whensent": "2011-05-16T05:53:13Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Morgyn",
    "subject": "Testing!",
    "body": "<p>That which does not kill me had better run pretty darn fast.</p>",
    "id": 32776,
    "haveread": true,
    "newmail": false,
    "whensent": "2011-04-24T23:49:37Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Vaelyn",
    "subject": "Halp please!",
    "body": "Dearest Karn, <BR><BR>I fear i've gotten stuck in a hole whilst exploring and can't get out! If you would be so very kind as to warp me back to the road when you've got a moment, i'll be your super-secret lover for all time.<BR><BR>... or at least very grateful!<BR><BR>Love, <BR><BR>Vaelynâ??",
    "id": 27763,
    "haveread": true,
    "newmail": false,
    "whensent": "2010-09-07T20:29:05Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Ona",
    "subject": "Eladamri OOC",
    "body": " Excuse me, but I would like to complain about a certin player in this game who has been bashing each and every one of my charactars. I know you play a big role in this game, somehow, not sure exactly how, I am sending this to Midevia as well just because I do not know who to take this to. Anyways, let me get right down to the point so I do not take up anymore of your time. Eladamri and I used to RP alot together when I first started playing this game. Though people warned me that she is not the best person to RP with, I now see why, and saw why for quite a while. It never bothered me until today though. I log in, and see Eladamri and Lucura at the road, everything is fine and dandy. I RP walking in and overheading something Lucura said, wanting into the RP, I say something to Lucura...then Eladamri started with this....well.... here's the entire RP.... it's small... ish<br>\n<br>\nYou cleared your mind.<br>\nYou read the public board.<br>\nYou read the public board.<br>\nLucura says [to Eladamri] : You're always blowing that Kel guy....<br>\nEladamri says [to Lucura] : I am?!<br>\nEladamri finds this to be news to hear...wow she blows the god of Fate...<br>\nLucura says [to Eladamri] : I'm guessing that is... Whatever it is I do not care as long as you leave me the fuck alone.<br>\nEladamri says [to Lucura] : Ooh you jealous and making this up! I'm honored. *purses up her lips to blow a smooch towards her grumpy stalker.*<br>\nEladamri loves Lucura.<br>\nOna simply mumbles a small something under her breath as she hears the words when she enters the area. A small shake of her head is given as she looks over the boards quite contently, arms crossed over her breasts as her midnight black hair floats in the chilly breeze. After nothing catches her attention, she wanders over to a nearby tree and lights up a joint, puffing on it breifly before inhaling a rather large hit. She would then place said joint between two small, carful digits and blow out her cloud of smoke as those sapphire eyes take in the clear, beautiful night's sky, or early morning, whatever works.<br>\nLucura says : I will fucking kill you...<br>\nEladamri grins to Lucura.<br>\nYou say [to Lucura] : **After that little threat, she clears her throat before speaking** Excuse me... But might I ask what the problem is here?<br>\nEladamri shifts all her weight to the tips of her glass slippers as she whisper to her grumpy luff man.<br>\nEladamri is whispering something to Lucura, but you cannot hear what.<br>\nLucura says [to you] : I do not believe I was speaking to you.<br>\nYou say [to Lucura] : **takes another hit of her joint** Was only asking darlin...<br>\nEladamri says [to you] : He was threating me, you ain't important. Go back to your skunk weed joint.<br>\nA brisk winter breeze rustles the trees, carrying snowflakes and woodsmoke.<br>\nLucura shakes his head.<br>\nYou say [to Eladamri] : Well luckily for me I can do two things at once. I may not be important to you, but what do I care about you anyways?<br>\nEladamri chuckles as she waits for Lucura to make good on this new threat, she even looked helpless and clearly was not armed. Tsk-tsk, he was sounding like a 'Sid follower threating a helpless unarmed person. Imp thought Yasec's followers wanted to spread their god's word and turn them to follow the 'devil'.<br><br>\nEladamri just ignores the smoked up junkies words. Ona was just a sad case.<br><br>\nAurican has entered the game...<br>\nLucura certianly would if he weren't tired as hell.<br>\nOna just thought of Eladamri as a slut, from Lucura's words, never doubting them for a minute. Though, she too would now ignore the rude woman, who obveously does not know whats good for her...until she opened her mouth again that is. Until then, she'd simply smoke her joint and relax.<br><br>\nEladamri knew Ona to be a super dodger and will never take any damage when attacked so imp don't bother to interact with a god-modder.<br><br>\nEladamri greets Aurican.<br>\nOna thinks eladamri should just shut her mouth, just because she hates all my past charactars does not mean she has to bash every single one of them. Ona's Rper has a whole list she could spam down here for everyone to see but does not feel like contributing to Eladamri's pathetic childish games and tries to find the ignore button, if there is one.<br><br>\nEladamri figures Ona tries imp will turn Ona's rp'er in for harassment. Smile-smile.<br><br>\nAurican greets Eladamri.<br>\nLucura leaves east.<br>\nYou tell Aurican : ooc Do you have a list of someone i could report this kid to?<br>\nAurican tells you : ooc: sadly i dont know who the deps are anymore lol<br>\nYou tell Aurican : ooc I will figure it out myself then. Thank you.<br><br>\nI apologize this is long, I double spaced the parts that Eladamri and Ona(me), posted, that are the main points to look at. Before all this even, with my past charactars. Kable, Bud, Dreams... Those are my main active ones with Ona at the moment but she's been rotten to them all, ICly, for no reason besides she hates me OOCly. I think the reason she is doing this is because I got involved with her charactar on one of my own, Sillian. Who was her mate. After I noticed she was one of those players who only like to cyber, I stopped playing on Sillian because I knew it would not stop. If rumors are true, Eladamri does nothing but cybering on this game. I tried finding an ignore button but could not. The reasons she said I \"God-mod\" is because of Bud, a charactar whom was jumped by at least six Calenwolves at once and it was six in the morning, my computer overheated and my posts were... well yes, godish..... after the overheating I immediatly got on the next morning and wrote an OOC letter on the boards, and fully aggreed with Eiric on what injuries Bud had from the night before and whatever happened to him, happened. I think Eladamri has been not only bashing, harrassing, and being completely childish with her charactars but as a player of the game, she has been overly rude for no reason whatsoever and feels she has the power to tell who, what, whenever she wants all while getting away with her selfish ways. I hope you take action on this, and order ether a temporary or perminate banned her from this game... thats just what I hope to happen. I know others have complained about her in the past, and I think this game would not only be a little more peaceful, but less drama OOCly on other players such as myself and many many others I have and still talk to today. Again, I apologize for this being so long, I did not expect to write this much but I wish for something to happen so I can continue enjoying the game and hope my other freind will as well. <br>\n<br>Sincerly,<br>\nMatt P.",
    "id": 26768,
    "haveread": true,
    "newmail": false,
    "whensent": "2010-04-09T05:36:18Z",
    "deleted": false
  },
  {
    "toname": "Karn",
    "name": "Blackfyre",
    "subject": "New dep ' Comman\"d",
    "body": " I've made a command to bring up a glossary of room attributes we Deputies have made and are plotting to utilize.The command is <i>room attributes</i>",
    "id": 24702,
    "haveread": true,
    "newmail": false,
    "whensent": "2010-01-15T10:37:38Z",
    "deleted": false
  }
]